## Introducción a las estructuras de datos de pandas
Series

In [5]:
import numpy as np
import pandas as pd
serie = pd.Series([4, 7, -6, 3, 2, 0])
serie

0    4
1    7
2   -6
3    3
4    2
5    0
dtype: int64

In [6]:
#Representacion de la serie en array PandasArray
serie.array

<PandasArray>
[4, 7, -6, 3, 2, 0]
Length: 6, dtype: int64

In [7]:
#Lista con indices
serie2= pd.Series([4, -7, 0], index=["a", "b", "c"])
serie2

a    4
b   -7
c    0
dtype: int64

In [8]:
serie2.index

Index(['a', 'b', 'c'], dtype='object')

In [9]:
serie2["c"]

0

In [10]:
serie2[serie2>0]

a    4
dtype: int64

In [11]:
serie2 * 2

a     8
b   -14
c     0
dtype: int64

In [12]:
#Tambien podemos comprobar si un indice existe en la serie
"c" in serie2

True

In [13]:
"z" in serie2

False

In [14]:
#Tambien podemos crear series a partir de diccionarios en python
diccionario={
    "CDM": 2332,
    "Edomex": 34535,
    "Guadalajara": 53535,
    "Chiapas": 2324
}
serie3=pd.Series(diccionario)
serie3

CDM             2332
Edomex         34535
Guadalajara    53535
Chiapas         2324
dtype: int64

In [15]:
#Tambien podemos convertir una serie en un diccionario
serie3.to_dict()

{'CDM': 2332, 'Edomex': 34535, 'Guadalajara': 53535, 'Chiapas': 2324}

In [16]:
#Elementos Nan
pd.isna(serie3)

CDM            False
Edomex         False
Guadalajara    False
Chiapas        False
dtype: bool

In [17]:
#Elementos no Nan
pd.notna(serie3)

CDM            True
Edomex         True
Guadalajara    True
Chiapas        True
dtype: bool

In [23]:
#Indice de una serie
serie3.name="Mexico"
serie3.index.name="estados"
serie3

estados
CDM             2332
Edomex         34535
Guadalajara    53535
Chiapas         2324
Name: Mexico, dtype: int64

In [26]:
serie.index=["Anderson", "Andrea", "Fernanda", "Alfredo", "Jovana", "Miriam"]
serie

Anderson    4
Andrea      7
Fernanda   -6
Alfredo     3
Jovana      2
Miriam      0
dtype: int64

## DATA FRAME
Un dataframe representa una tabla rectangular de datos, y contiene una
colección de columnas ordenada y con nombre, cada una de las cuales
puede tener un tipo de valor distinto (numérico, cadena de texto, booleano,
etc.).

In [28]:
data= {
    "estados":["Cdmx", "Jalisco", "Nayarit", "Tamaulipas"],
    "poblacion": [295323, 23234, 21313, 102323],
    "puestos de tacos": [2133, 983, 133, 453]
}
frame =pd.DataFrame(data)
frame

      estados  poblacion  puestos de tacos
0        Cdmx     295323              2133
1     Jalisco      23234               983
2     Nayarit      21313               133
3  Tamaulipas     102323               453

In [29]:
#Para grandes bancos de datos podemos listar con .head
frame.head()

      estados  poblacion  puestos de tacos
0        Cdmx     295323              2133
1     Jalisco      23234               983
2     Nayarit      21313               133
3  Tamaulipas     102323               453

In [30]:
#Devuelve las 5 ultimas columnas
frame.tail()
#Tambien podemos indicar que columnas mostrar
pd.DataFrame(data, columns=["puestos de tacos", "estados", "poblacion"])

   puestos de tacos     estados  poblacion
0              2133        Cdmx     295323
1               983     Jalisco      23234
2               133     Nayarit      21313
3               453  Tamaulipas     102323

In [31]:
#Si se le pasa una columna no existente retornara Nan
pd.DataFrame(data, columns=["puestos de tacos", "estados", "poblacion", "estadios"])

   puestos de tacos     estados  poblacion estadios
0              2133        Cdmx     295323      NaN
1               983     Jalisco      23234      NaN
2               133     Nayarit      21313      NaN
3               453  Tamaulipas     102323      NaN

In [32]:
#Columnas del frame
frame.columns

Index(['estados', 'poblacion', 'puestos de tacos'], dtype='object')

In [33]:
#Valor especifico por columna
frame["puestos de tacos"]

0    2133
1     983
2     133
3     453
Name: puestos de tacos, dtype: int64

In [34]:
#Por filas
frame.loc[1]

estados             Jalisco
poblacion             23234
puestos de tacos        983
Name: 1, dtype: object

In [35]:
frame.iloc[3]

estados             Tamaulipas
poblacion               102323
puestos de tacos           453
Name: 3, dtype: object

In [37]:
#Modificando registros de las columnas
frame["estadios"]=13.4
frame

      estados  poblacion  puestos de tacos  estadios
0        Cdmx     295323              2133      13.4
1     Jalisco      23234               983      13.4
2     Nayarit      21313               133      13.4
3  Tamaulipas     102323               453      13.4

In [40]:
#podemos designar varios valores
frame["estadios"]=np.arange(4.)#el rango debe coincidir con la longitud del dataframe
frame

      estados  poblacion  puestos de tacos  estadios
0        Cdmx     295323              2133       0.0
1     Jalisco      23234               983       1.0
2     Nayarit      21313               133       2.0
3  Tamaulipas     102323               453       3.0

In [44]:
valores=pd.Series([-21, 2.43,53], index=["Uno", "dos", "tres"])
frame["estadios"]=valores
frame

      estados  poblacion  puestos de tacos  estadios
0        Cdmx     295323              2133       NaN
1     Jalisco      23234               983       NaN
2     Nayarit      21313               133       NaN
3  Tamaulipas     102323               453       NaN

In [45]:
#del -> para borrar columnas
del frame["estadios"]
frame.columns

Index(['estados', 'poblacion', 'puestos de tacos'], dtype='object')

In [47]:
frame

      estados  poblacion  puestos de tacos
0        Cdmx     295323              2133
1     Jalisco      23234               983
2     Nayarit      21313               133
3  Tamaulipas     102323               453

In [46]:
#Tambien es posible transponer dataframes
frame.T

                       0        1        2           3
estados             Cdmx  Jalisco  Nayarit  Tamaulipas
poblacion         295323    23234    21313      102323
puestos de tacos    2133      983      133         453

De igual manera que con numpy podemos asignar indices:
frame3.index.name = “year”
frame3.columns.name = “state”
frame3
state Ohio Nevada
year
2000 1.5 NaN
2001 1.7 2.4
2002 3.6 2.9

In [48]:
#Los data frames no poseen atributo name, su metodo es to_numpy
frame.to_numpy()

array([['Cdmx', 295323, 2133],
       ['Jalisco', 23234, 983],
       ['Nayarit', 21313, 133],
       ['Tamaulipas', 102323, 453]], dtype=object)

## Objetos indice
Los objetos índice de pandas son responsables de albergar etiquetas de
ejes (incluyendo los nombres de columnas de un dataframe) y otros
metadatos (como el nombre o los nombres de los ejes).

In [49]:
obj=pd.Series(np.arange(3), index=["A", "B", "C"])
index = obj.index
index

Index(['A', 'B', 'C'], dtype='object')

In [50]:
index[1:]
#Los indices son inmutables por lo tanto no pueden ser modificados

Index(['B', 'C'], dtype='object')

In [51]:
labels=pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [52]:
obj2=pd.Series([1.5, -3.5, 5], index=labels)
obj2

0    1.5
1   -3.5
2    5.0
dtype: float64

In [53]:
obj2.index is labels

True

Además de ser de estilo array, los índices se comportan también como un conjunto de tamaño fijo:

In [54]:
frame

      estados  poblacion  puestos de tacos
0        Cdmx     295323              2133
1     Jalisco      23234               983
2     Nayarit      21313               133
3  Tamaulipas     102323               453

In [55]:
frame.columns

Index(['estados', 'poblacion', 'puestos de tacos'], dtype='object')

In [59]:
"poblacion" in frame.columns

True

In [61]:
"jalisco" in frame.index #No es un indice

False

## Funcionalidad esencial
Reindexacion

In [65]:
#reindexando obj2
obj2 = obj.reindex(["A", "B", "C"]) #Indices de obj a obj2
obj2

A    0
B    1
C    2
dtype: int32

In [66]:
obj3=pd.Series(["Amarillo", "Cafe", "Azul"], index=[0, 5, 6])
obj3

0    Amarillo
5        Cafe
6        Azul
dtype: object

In [79]:
#Para series ordenadas
obj3.reindex(np.arange(6), method="ffill")
obj3
#Tambien podemos hacerlo asi
obj3.reindex(index=["p", "y", "l"])

p    NaN
y    NaN
l    NaN
dtype: object

## ELIMINAR ENTRADAS

In [83]:
obj=pd.Series(np.arange(4), index=["a", "b", "c", "d"])
obj

a    0
b    1
c    2
d    3
dtype: int32

In [84]:
obj.drop("c")

a    0
b    1
d    3
dtype: int32

Con objetos DataFrame, los valores de índice se pueden borrar de
cualquier eje. Para ilustrar esto, primero creamos un dataframe de ejemplo:

In [94]:
datos=pd.DataFrame(np.arange(16).reshape((4,4)), index=["a","b","c","d"], columns=["Uno","Dos","Tres","cuatro"])
datos

   Uno  Dos  Tres  cuatro
a    0    1     2       3
b    4    5     6       7
c    8    9    10      11
d   12   13    14      15

In [95]:
datos.drop(index=["a", "d"])

   Uno  Dos  Tres  cuatro
b    4    5     6       7
c    8    9    10      11

In [96]:
datos.drop(columns=["cuatro"]) #Tambien se puede usar .drop("cutro", axis=1)

   Uno  Dos  Tres
a    0    1     2
b    4    5     6
c    8    9    10
d   12   13    14

In [97]:
#Seleccionar indices
datos[1:2]

   Uno  Dos  Tres  cuatro
b    4    5     6       7

In [99]:
datos.loc[["a"]]

   Uno  Dos  Tres  cuatro
a    0    1     2       3

## ARITMETICA Y ALINEACION DE DATOS

In [102]:
s1=pd.Series([-5.2, -3.4], index=["a","c"])
s2=pd.Series([2.4, 14.4], index=["b", "d"])
print(s1)
print(s2)
s1 + s2

a   -5.2
c   -3.4
dtype: float64
b     2.4
d    14.4
dtype: float64

a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [104]:
#Metodos aritmeticos con valores de relleno
s1.add(s2, fill_value=0)

a    -5.2
b     2.4
c    -3.4
d    14.4
dtype: float64

In [105]:
1/s1

a   -0.192308
c   -0.294118
dtype: float64

In [106]:
s1.rdiv(1)
#Hay muchos metodos con r para operaciones aritmeticas

a   -0.192308
c   -0.294118
dtype: float64

## Operaciones entre objetos DataFrame y Series

In [108]:
arr=np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [109]:
arr[0]

array([0., 1., 2., 3.])

In [110]:
arr - arr[0] #A esto se le denomina fusion

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [111]:
frame=pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list("abd"), index=["dsad","dfsf","fhfgf","iewp"])
series=frame.iloc[0]
frame

         a     b     d
dsad   0.0   1.0   2.0
dfsf   3.0   4.0   5.0
fhfgf  6.0   7.0   8.0
iewp   9.0  10.0  11.0

In [112]:
series

a    0.0
b    1.0
d    2.0
Name: dsad, dtype: float64

In [113]:
frame-series

         a    b    d
dsad   0.0  0.0  0.0
dfsf   3.0  3.0  3.0
fhfgf  6.0  6.0  6.0
iewp   9.0  9.0  9.0

In [116]:
series2 = pd.Series(np.arange(3), index=["c", "e","f"])
series2

c    0
e    1
f    2
dtype: int32

In [120]:
print(frame + series2)
series3= frame["d"]
frame

        a   b   c   d   e   f
dsad  NaN NaN NaN NaN NaN NaN
dfsf  NaN NaN NaN NaN NaN NaN
fhfgf NaN NaN NaN NaN NaN NaN
iewp  NaN NaN NaN NaN NaN NaN

         a     b     d
dsad   0.0   1.0   2.0
dfsf   3.0   4.0   5.0
fhfgf  6.0   7.0   8.0
iewp   9.0  10.0  11.0

In [121]:
series3

dsad      2.0
dfsf      5.0
fhfgf     8.0
iewp     11.0
Name: d, dtype: float64

In [122]:
frame.sub(series3, axis="index")

         a    b    d
dsad  -2.0 -1.0  0.0
dfsf  -2.0 -1.0  0.0
fhfgf -2.0 -1.0  0.0
iewp  -2.0 -1.0  0.0

## APLICACION Y ASIGNACION DE FUNCIONES

In [123]:
frames=pd.DataFrame(np.random.standard_normal((4,3)), columns=list("abc"), index=["uno", "dos", "tres", "cuatro"])
frames

               a         b         c
uno    -0.473117  0.693788  0.579909
dos     1.069140 -0.209604  1.029301
tres   -1.226635 -0.019487  0.027234
cuatro -1.616794  0.904253 -0.749568

In [124]:
np.abs(frame) #Valor absoluto

         a     b     d
dsad   0.0   1.0   2.0
dfsf   3.0   4.0   5.0
fhfgf  6.0   7.0   8.0
iewp   9.0  10.0  11.0

Aquí la función f, que calcula la diferencia entre el máximo y el mínimo de una serie, se invoca una vez para cada columna en frame. El resultado es que una serie tiene las columnas de frame como índice

In [125]:
def fi(x):
    return x.max()-x.min()
frame.apply(fi)

a    9.0
b    9.0
d    9.0
dtype: float64

In [126]:
frame.apply(fi, axis="columns")

dsad     2.0
dfsf     2.0
fhfgf    2.0
iewp     2.0
dtype: float64

In [127]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])
frame.apply(f2)

       a     b     d
min  0.0   1.0   2.0
max  9.0  10.0  11.0

También se pueden emplear funciones Python por elementos.
Supongamos que queremos calcular una cadena de texto formateada a partir de cada valor de punto flotante en frame. Esto puede hacerse con applymap:

In [128]:
def format(x):
    return f"{x:.2f}"
frame.applymap(format)

          a      b      d
dsad   0.00   1.00   2.00
dfsf   3.00   4.00   5.00
fhfgf  6.00   7.00   8.00
iewp   9.00  10.00  11.00

In [132]:
#La razón del nombre applymap es que las series tienen un método map para aplicar una función por elementos:

frame["d"].map(format)

dsad      2.00
dfsf      5.00
fhfgf     8.00
iewp     11.00
Name: d, dtype: object

In [4]:
import pandas as pd
import numpy as np

In [16]:
#Ordenando por indice
frame= pd.DataFrame(np.arange(8).reshape((2, 4)), index=["Dos","Uno"], columns=["D","A", "B", "C"])
frame

     D  A  B  C
Dos  0  1  2  3
Uno  4  5  6  7

In [20]:
frame.sort_index() #Por alguna razon  no esta ordenando

     D  A  B  C
Dos  0  1  2  3
Uno  4  5  6  7

In [21]:
frame.sort_index(axis="columns")

     A  B  C  D
Dos  1  2  3  0
Uno  5  6  7  4

In [23]:
#Ordenar por valores
obj=pd.Series([4,6,-8,1])
obj

0    4
1    6
2   -8
3    1
dtype: int64

In [24]:
obj.sort_values()

2   -8
3    1
0    4
1    6
dtype: int64

In [33]:
#Al ordenar un dataframe, es posible emplear los datos de una o varias columnas como claves de ordenación.
frame=pd.DataFrame({"b": [22,6,8], "a": [1,7,92]})
frame

    b   a
0  22   1
1   6   7
2   8  92

In [34]:
frame.sort_values("b")

    b   a
1   6   7
2   8  92
0  22   1

In [36]:
frame.sort_values(["a", "b"])

    b   a
0  22   1
1   6   7
2   8  92

La asignación de rangos hace lo propio, es decir, asigna rangos desde
uno hasta el número de puntos de datos válidos de un array, empezando por
el valor mínimo. Los métodos rank para series y dataframes son el punto de
partida; por defecto, rank desempata asignando a cada grupo el rango
medio:

In [37]:
obj.rank()

0    3.0
1    4.0
2    1.0
3    2.0
dtype: float64

In [38]:
#Tambien se pueden ordenar en el orden en el que se se observan
obj.rank(method="first")

0    3.0
1    4.0
2    1.0
3    2.0
dtype: float64

In [40]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a":[0, 1, 0, 1],"c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [41]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

## Indices con ejes con etiquetas duplicadas

In [50]:
s1=pd.Series(np.arange(5),index=["a", "a", "b", "b", "c"])
s1

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [53]:
#Indicamos si sus etiquetas son unicas o no
s1.index.is_unique()

TypeError: 'bool' object is not callable

In [54]:
s1["a"]

a    0
a    1
dtype: int32

## Resumir y calcular estadisticas descriptivas
Los objetos pandas están equipados con un conjunto de métodos
matemáticos y estadísticos comunes. La mayoría entran en la categoría de
reducciones o estadísticas de resumen, es decir, métodos que extraen un
solo valor (como la suma o el promedio) de una serie, o una serie de valores
de las filas y columnas de un dataframe.

In [57]:
df=pd.DataFrame([[1.5, np.nan], [4.2, -85], [np.nan, np.nan], [0.13, -1.54]], index=["a", "b", "c", "d"], columns=["ono", "dos"])
df

    ono    dos
a  1.50    NaN
b  4.20 -85.00
c   NaN    NaN
d  0.13  -1.54

In [58]:
df.sum()

ono     5.83
dos   -86.54
dtype: float64

In [59]:
df.sum(axis="columns")

a     1.50
b   -80.80
c     0.00
d    -1.41
dtype: float64

In [60]:
df.sum(axis="index", skipna=False)

ono   NaN
dos   NaN
dtype: float64

In [61]:
df.sum(axis="columns", skipna=False)

a      NaN
b   -80.80
c      NaN
d    -1.41
dtype: float64

Algunos métodos, como idxmin e idxmax, devuelven estadísticas
indirectas, como el valor de índice en el que se alcanzan los valores mínimo
o máximo:

In [63]:
df.mean(axis="columns")

a     1.500
b   -40.400
c       NaN
d    -0.705
dtype: float64

In [65]:
df.idxmax()

ono    b
dos    d
dtype: object

In [66]:
#acumulaciones
df.cumsum()

    ono    dos
a  1.50    NaN
b  5.70 -85.00
c   NaN    NaN
d  5.83 -86.54

Algunos métodos no son ni reducciones ni acumulaciones. Un ejemplo
es describe, dado que produce varias estadísticas de resumen de una sola
vez:

In [67]:
df.describe()

            ono        dos
count  3.000000   2.000000
mean   1.943333 -43.270000
std    2.070902  59.015132
min    0.130000 -85.000000
25%    0.815000 -64.135000
50%    1.500000 -43.270000
75%    2.850000 -22.405000
max    4.200000  -1.540000

In [70]:
obj=pd.Series(["a","a", "b", "c"] * 4)
obj.describe() #238

count     16
unique     3
top        a
freq       8
dtype: object

## Correlacion y covarianza
Algunas estadísticas de resumen, como la correlación y la covarianza, se
calculan a partir de pares de argumentos. Supongamos algunos dataframes
de precios y volúmenes de acciones, obtenidos originalmente de Yahoo!
Finance y disponibles en archivos pickle binarios de Python

In [75]:
price = pd.read_pickle("yahoo_price.pkl")
volume= pd.read_pickle("yahoo_volume.pkl")

In [77]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

El método corr del objeto Series calcula la correlación de los valores
superpuestos, no nulos y alineados por índice en dos series. De forma
similar, cov calcula la covarianza:

In [78]:
#Aqui comparamos si MSFT tiene correlacion con IBM
returns["MSFT"].corr(returns["IBM"])

0.49976361144151155

In [79]:
#Aqui calculamos la covarianza de MSFT respecto a IBM
returns["MSFT"].cov(returns["IBM"])

8.870655479703549e-05

In [80]:
#Ahora calculamos la correlacion
returns["MSFT"].corr(returns["IBM"])

0.49976361144151155

In [81]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [82]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

Utilizando el método corrwith del objeto DataFrame se pueden calcular
correlaciones por pares entre las columnas o filas de un dataframe con otra
serie o dataframe. Pasar una serie devuelve otra con el valor de correlación
calculado para cada columna:

In [83]:
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [84]:
#Ahora las correlaciones con respecto con volumen
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

Sin embargo, pasar axis=”columns” hace las cosas fila a fila. En todos
los casos, los puntos de datos se alinean por etiqueta antes de que se calcule
la correlación.
## Valores unicos, recuentos de valores y pertenencia
Otra clase de métodos asociados extrae información acerca de los
valores contenidos en una serie unidimensional

In [88]:
obje=pd.Series(["c", "a", "d", "a", "b", "b", "c", "c"])
uniques= obje.unique()
uniques # Proporciona un array con valores unicos de la serie

array(['c', 'a', 'd', 'b'], dtype=object)

In [89]:
obje.value_counts()

c    3
a    2
b    2
d    1
dtype: int64

La serie se ordena por valor en orden descendente por comodidad.
También está disponible value_counts como método pandas de nivel
superior, que se puede emplear con arrays NumPy u otras secuencias de
Python:

In [90]:
pd.value_counts(obje.to_numpy(), sort=False)

c    3
a    2
d    1
b    2
dtype: int64

isin realiza una comprobación de la pertenencia a un conjunto
vectorizado y puede ser útil al filtrar un conjunto de datos para obtener un
subconjunto de valores en una serie o una columna de un dataframe:

In [91]:
#isin 
mask =obje.isin(["b", "c"])
mask

0     True
1    False
2    False
3    False
4     True
5     True
6     True
7     True
dtype: bool

In [92]:
obje[mask]

0    c
4    b
5    b
6    c
7    c
dtype: object

Relacionado con isin tenemos el método Index.get_indexer, que
proporciona un array de índices a partir de otro array de valores
posiblemente no diferenciados, para obtener otro array de valores
diferentes:

In [96]:
to_match= pd.Series(["c","a","b","b","c","a"])
unique_vals=pd.Series(["c","b","a"])
indices=pd.Index(unique_vals).get_indexer(to_match)
indices

array([0, 2, 1, 1, 0, 2], dtype=int64)